# RebarHandlePositionData Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarHandlePositionData Properties
RebarHandlePositionData Class See Also
---
The RebarHandlePositionData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
RebarHandlePositionData Class
Autodesk.Revit.DB.Structure Namespace